"""ДЗ 3. Простий калькулятор

Програма повинна виконувати прості математичні дії +,-, *, /.. Користувачу пропонується заздалегідь ввести числа і математичну операцію над цими числами,
програма, відповідно до дії, вираховує і висвітлює результат.

Якщо операція поділити (/) то зробити додаткову перевірку на те, що при ділені не можна ділити на нуль і висвітлити повідомлення для користувача."""

print("\nДЗ 3. Простий калькулятор: \n")

print("Доступні операції:")
print("Додавання (+)")
print("Віднімання (-)")
print("Множення (*)")
print("Ділення (/)")

operation = input("\nВведіть операцію (+, -, *, /): ")

if operation not in ['+', '-', '*', '/']:
    print("Неправильна операція. Введіть коректну операцію.")
else:
    num1 = float(input("\nВведіть перше число: "))
    num2 = float(input("Введіть друге число: "))

    if operation == '+':
        print("Результат:", (num1 + num2))
    elif operation == '-':
        print("Результат:", (num1 - num2))
    elif operation == '*':
        print("Результат:", (num1 * num2))
    elif operation == '/':
        if num2 == 0:
            print("\nПомилка! Ділення на нуль недопустиме.")
        else:
            print("Результат:", (num1 / num2))

"""ДЗ 4. Переміщення елементів в списку

Ваша програма повинна перенести останній список елементів із кінця в початок, т.е. останній елемент списку повинен стати першим.
При цьому послідовність інших елементів не повинна змінюватися.

Якщо список пустий, тоді має висвітлитись пустий список, якщо тільки один елемент, то тоді аналогічно висвітлюється список без переміщення,
якщо елементів більше ніж 1 - має відбутись переміщення і виведення результату.

Приклад:

[] => []
[1] => [1]
[12, 3, 4, 10] => [10, 12, 3, 4]
[12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]"""

print("\nДЗ 4. Переміщення елементів в списку: ")

lst_5 = []
if len(lst_5) == 0:
    print("Пустий список")
elif len(lst_5) == 1:
    print("Список без переміщення")
else:
    last_el_lst_5 = lst_5.pop()
    lst_5.insert(0, last_el_lst_5)
    print(lst_5)

lst_6 = [1]
if len(lst_6) == 0:
    print("Пустий список")
elif len(lst_6) == 1:
    print("Список без переміщення")
else:
    last_el_lst_6 = lst_6.pop()
    lst_6.insert(0, last_el_lst_6)
    print(lst_6)

lst_7 = [12, 3, 4, 10]
if len(lst_7) == 0:
    print("Пустий список")
elif len(lst_7) == 1:
    print("Список без переміщення")
else:
    last_el_lst_7 = lst_7.pop()
    lst_7.insert(0, last_el_lst_7)
    print(lst_7)

lst_8 = [12, 3, 4, 10, 8]
if len(lst_8) == 0:
    print("Пустий список")
elif len(lst_8) == 1:
    print("Список без переміщення")
else:
    last_el_lst_8 = lst_8.pop()
    lst_8.insert(0, last_el_lst_8)
    print(lst_8)

"""ДЗ 5. Додаткове Д3

Написати програму, яка переміщає всі нулі в кінці списку.
Ваша задача — змінити список так, щоб всі нулі опинились в кінці списку.
Порядок всіх інших чисел повинен зберегтися!

приклад:

[0, 1, 0, 3, 12] -> [1, 3, 12, 0, 0]
[0] -> [0]
[1, 0, 3, 0, 0, 0, 5] -> [1, 3, 5, 0, 0, 0, 0]
[9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]"""

print("\nДЗ 5. Додаткове Д3: ")

lst_1 = [0, 1, 0, 3, 12]
zero_lst_1 = lst_1.count(0)
lst_1 = [num for num in lst_1 if num != 0]
lst_1.extend([0] * zero_lst_1)
print(lst_1)

lst_2 = [0]
zero_lst_2 = lst_2.count(0)
lst_2 = [num for num in lst_2 if num != 0]
lst_2.extend([0] * zero_lst_2)
print(lst_2)

lst_3 = [1, 0, 3, 0, 0, 0, 5]
zero_lst_3 = lst_3.count(0)
lst_3 = [num for num in lst_3 if num != 0]
lst_3.extend([0] * zero_lst_3)
print(lst_3)

lst_4 = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
zero_lst_4 = lst_4.count(0)
lst_4 = [num for num in lst_4 if num != 0]
lst_4.extend([0] * zero_lst_4)
print(lst_4)